# Universal Array Functions 普遍的数组方法
import numpy as np
arr = np.arange(0,10)
 # 使用 NumPy 的 np.sqrt() 函数来计算给定数组中每个元素的平方根
# print(np.sqrt(arr))
# [0.         1.         1.41421356 1.73205081 2.         2.23606798
#  2.44948974 2.64575131 2.82842712 3.        ]

#Calcualting exponential (e^)
print(np.exp(arr))
# [1.00000000e+00 2.71828183e+00 7.38905610e+00 2.00855369e+01
#  5.45981500e+01 1.48413159e+02 4.03428793e+02 1.09663316e+03
#  2.98095799e+03 8.10308393e+03]

#same as arr.max()
# print(np.max(arr)) # 9

# 符号
# print(np.sign(arr))

#  np.sin() 正弦值
# print(np.sin(arr))
# [ 0.          0.84147098  0.90929743  0.14112001 -0.7568025  -0.95892427
#  -0.2794155   0.6569866   0.98935825  0.41211849]

# 求 自然对数（以基数 e 为底的对数
# print(np.log(arr))
# [      -inf 0.         0.69314718 1.09861229 1.38629436 1.60943791
#  1.79175947 1.94591015 2.07944154 2.19722458]